<style lang="less">
    #protocol {
        margin-top: 30px;
        .logo-img {
            cursor: pointer;
            width: 150px;
        }
        .content {
            font-size: 14px;
            margin-top: 30px;
            height: 580px;
            border: 1px solid #ccc;
            border-radius: 3px;
            box-shadow: 1px 1px 1px #ccc;
            overflow: scroll;
            padding: 60px 40px;
            h3 {
                text-align: center;
                font-weight: 600;
                padding-bottom: 30px;
            }
            h5,
            .strong{
                font-weight: 600;
            }
            h5 {
                font-size: 16px;
                padding-top: 20px;
            }
            p {
                margin-top: 20px;
            }
        }
    }
</style>

<template>
    <div id="protocol">
        <Row>
            <Col span="16" offset="4">
                <img src="../../../img/logo.png" class="logo-img" @click="goHome" alt="log" />
            </Col>
        </Row>
        <Row>
            <Col class="content" span="16" offset="4">
                <h3>骆驼用户使用协议</h3>
                <h5 class="title">特别提示：</h5>
                <p class="strong">您在使用骆驼提供的各项服务之前，请您务必审慎阅读、充分理解本协议各条款内容，特别是以粗体标注的部分，包括但不限于免除或者限制责任的条款。您一旦在本网站注册，即视为您已了解并完全同意本服务协议各项内容，包括骆驼对服务协议随时所做的任何修改，并成为骆驼用户</p>
                <h5>一、总则</h5>
                <p>1.1、在进行注册过程中只要您点击注册页面的"注册"按钮并按照本网站注册程序成功注册为用户，您的行为表示您同意并签署了本服务协议，本服务协议即在您和本网站之间产生法律效力。请您务必在注册之前认真阅读全部服务协议内容，如有任何疑问，可向本网站咨询。</p>
                <p>1.2、用户注册成功后，骆驼将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</p>
                <p>1.3、用户一经注册骆驼帐号，除非子频道要求单独开通权限，用户有权利用该帐号使用骆驼各个频道的单项服务，当用户使用骆驼各单项服务时，用户的使用行为视为其对该单项服务的服务条款以及骆驼在该单项服务中发出的各类公告的同意。</p>
                <h5>二、用户信息使用及保护规则</h5>
                <p>2.1、骆驼帐号（即骆驼用户ID）的所有权归骆驼，用户按注册页面引导填写信息，阅读并同意本协议且完成全部注册程序后，即可获得骆驼帐号并成为骆驼用户。用户应提供及时、详尽及准确的个人资料，并不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。如果因注册信息不真实或更新不及时而引发的相关问题，骆驼不负任何责任。用户提交的帐号名称、头像和简介等注册信息中不得出现违法和不良信息，经骆驼审核，如存在上述情况，骆驼将不予注册；同时，在注册后，如发现用户以虚假信息骗取帐号名称注册，或其帐号头像、简介等注册信息存在违法和不良信息的，骆驼有权不经通知单方采取限期改正、暂停使用、注销登记、收回等措施。</p>
                <p>2.2、为了向您提供更好的服务，骆驼会在您首次注册或使用本网站服务的情况下系统自动存储您的相关信息。如您发现您的帐号遭他人非法使用，应立即通知骆驼。互联网上不排除因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，此类情况与骆驼无关。</p>
                <p>2.3、骆驼将合理使用所存储的信息，使用范围包括【1、为了让您更多地了解市场变化趋势，及时掌握有关讯息，我们会根据您预留的联系方式，不定期向您推送最新的房产知识及行情变化；2、为了更好地服务客户，我们会不断地对本网站系统进行技术更新，在此过程中可能需要使用您的信息进行技术改造相关工作；3、我们可能会对骆驼服务的使用情况进行统计。同时，骆驼可能会与公众分享这些统计信息，以展示我们服务的整体使用趋势或市场行情的客观情况，这些统计信息不包含您的任何身份识别信息；4、为了更好的向您提供资产管理服务，我们可能会将您的有限信息提供给骆驼旗下的资产管理公司；】。骆驼承诺，以上信息的使用将严格遵循最少够用原则，即尽量最少的使用您的信息以达到使用目的。</p>
                <p>2.4、请您不要将您的帐号、密码转让或出借予他人使用。如您发现您的帐号遭他人非法使用，应立即通知骆驼，互联网上不排除因黑客行为或用户的保管疏忽导致帐号、密码遭他人非法使用，此类情况与骆驼无关。 </p>
                <p>2.5、当您使用骆驼产品进行支付、登录等操作的时候，服务器会自动收取并记录一些必要的信息，如IP地址、服务访问异常信息、以及部分设备信息等，以保障您在使用骆驼服务时账户登录和支付过程的安全，进而保护您的上网安全。您使用骆驼的服务，即表示您同意骆驼可以按照本协议的相关约定处理您的个人信息。骆驼可能会与合作伙伴共同向您提供您所要求的服务或者共同向您展示您可能感兴趣的内容。在信息为该项产品/服务所必须的情况下，您同意骆驼可与其分享必要的信息。并且，骆驼会要求其确保数据安全并且禁止用于任何其他用途。除此之外，骆驼不会向任何无关第三方提供或分享信息。</p>
            </Col>
        </Row>
    </div>
</template>


<script>
    export default {
        data() {
            return {

            }
        },
        methods: {
            goHome: function () {
                this.$router.push('/');
            }
        }
    }
</script>