-- MySQL dump 10.13  Distrib 5.7.24, for osx10.13 (x86_64)
--
-- Host: localhost    Database: graduate
-- ------------------------------------------------------
-- Server version	5.7.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `conveyance`
--

DROP TABLE IF EXISTS `conveyance`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `conveyance` (
  `conveyanceId` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `userId` int(11) NOT NULL,
  `province` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` varchar(225) COLLATE utf8mb4_unicode_ci NOT NULL,
  `category` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `company` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `length` double(8,2) NOT NULL,
  `width` double(8,2) NOT NULL,
  `height` double(8,2) NOT NULL,
  `price` double(8,2) NOT NULL,
  `number` int(11) NOT NULL,
  `type` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `maxWeight` double(8,2) NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `imagePath` text COLLATE utf8mb4_unicode_ci,
  `usedStatus` char(1) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `checkedStatus` char(1) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `checkedTime` datetime DEFAULT NULL,
  `status` char(1) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`conveyanceId`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `conveyance`
--

LOCK TABLES `conveyance` WRITE;
/*!40000 ALTER TABLE `conveyance` DISABLE KEYS */;
INSERT INTO `conveyance` VALUES (1,69,'天津市','天津市','北辰区','天津市天津市北辰区小淀物流园9号','个人','',18.00,4.00,4.00,7.00,21,'普通货车',36.00,'天津市天津市北辰区小淀物流园9号出租','','conveyance/2091840510f24778bacbcd0364adfc95.jpeg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(2,17,'北京市','北京市','东城区','北京市北京市东城区安外胜古中路1号蓝宝商务大厦A座','公司','北京测试测试有限公司',16.00,15.00,4.00,3.00,7,'普通货车',141.00,'北京市北京市东城区安外胜古中路1号蓝宝商务大厦A座出租','','conveyance/60dc31dbc08449098834e6f591aeb915.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(3,54,'山东省','枣庄市','薛城区','山东省枣庄市薛城区张岭村西345省道路北','个人','',9.00,8.00,2.00,6.00,36,'普通货车',185.00,'山东省枣庄市薛城区张岭村西345省道路北出租','','conveyance/677363.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(4,22,'江苏省','连云港市','新浦区','江苏省连云港市新浦区临洪大道22号','公司','连云港树人科创食品添加剂有限公司',18.00,15.00,5.00,20.00,26,'其他',70.00,'江苏省连云港市新浦区临洪大道22号出租','','conveyance/8ef4b8f67a654357b61b2d2cf2023c73.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(5,11,'贵州省','安顺市','西秀区','贵州省安顺市西秀区西秀经济开发区两六路1.68公里','公司','贵州安顺云鹫食品有限公司',7.00,3.00,2.00,15.00,5,'普通货车',183.00,'贵州省安顺市西秀区西秀经济开发区两六路1.68公里出租','','conveyance/c57f35705927474faea720e2125d9082.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(6,65,'上海市','上海市','松江区','上海市上海市松江区泗泾工业区九干路99弄宇申国际2号楼316室','个人','',17.00,8.00,4.00,12.00,31,'大货车',153.00,'上海市上海市松江区泗泾工业区九干路99弄宇申国际2号楼316室出租','','conveyance/0b35a0b47c5a48f286ce61c5d374571a.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(7,83,'山东省','烟台市','莱阳市','山东省烟台市莱阳市五龙北路585号','个人','',8.00,6.00,3.00,18.00,6,'其他',54.00,'山东省烟台市莱阳市五龙北路585号出租','','conveyance/2981a8c440d64831bbc49973ac2da015.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(8,51,'河南省','南阳市','宛城区','河南省南阳市宛城区独山大道东方同安小区7号楼4单元202室','个人','',15.00,12.00,2.00,18.00,14,'小货车',39.00,'河南省南阳市宛城区独山大道东方同安小区7号楼4单元202室出租','','conveyance/655117.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(9,35,'贵州省','安顺市','西秀区','贵州省安顺市西秀区贵州省安顺开发区双阳产业园双新路1号','公司','贵州天赐贵宝食品有限公司',14.00,7.00,2.00,17.00,4,'普通货车',100.00,'贵州省安顺市西秀区贵州省安顺开发区双阳产业园双新路1号出租','','conveyance/707223.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(10,80,'云南省','昆明市','官渡区','云南省昆明市官渡区云南昆明官渡区新螺蛳湾国际商贸城二期5号写字楼701室','个人','',9.00,3.00,2.00,6.00,12,'面包车',22.00,'云南省昆明市官渡区云南昆明官渡区新螺蛳湾国际商贸城二期5号写字楼701室出租','','conveyance/a06c27fc5ea04716bc1e3b3e538a8e57.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(11,81,'天津市','天津市','武清区','天津市天津市武清区中国天津市武清开发区泉发路22号','个人','',16.00,8.00,2.00,13.00,6,'面包车',147.00,'天津市天津市武清区中国天津市武清开发区泉发路22号出租','','conveyance/e716ee0d09f94363b11209e58801dc70.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(12,5,'浙江省','嘉兴市','嘉善县','浙江省嘉兴市嘉善县罗星街道银秀路65号','公司','嘉善奥德利机械密封件厂',13.00,4.00,3.00,19.00,7,'大货车',22.00,'浙江省嘉兴市嘉善县罗星街道银秀路65号出租','','conveyance/0f159dd011314334b840eb42041af5a5.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(13,11,'四川省','成都市','武侯区','四川省成都市武侯区高新区环球中心E2区10楼2-1-1007','个人','',7.00,16.00,5.00,8.00,8,'普通货车',20.00,'四川省成都市武侯区高新区环球中心E2区10楼2-1-1007出租','','conveyance/49f11323bc3e4b928c9497430b0d224a.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(14,42,'广东省','广州市','番禺区','广东省广州市番禺区广州市番禺区钟村镇谢村开发区25号广州贝奇饮料公司','公司','广州市贝奇饮料有限公司',13.00,17.00,2.00,15.00,21,'大货车',79.00,'广东省广州市番禺区广州市番禺区钟村镇谢村开发区25号广州贝奇饮料公司出租','','conveyance/667765.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(15,8,'上海市','上海市','松江区','上海市上海市松江区上海市松江区欣玉路555号','个人','',11.00,11.00,4.00,5.00,29,'大货车',182.00,'上海市上海市松江区上海市松江区欣玉路555号出租','','conveyance/709173.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(16,91,'河南省','郑州市','二七区','河南省郑州市二七区南四环百荣商贸城A1区12排301号','个人','',8.00,12.00,3.00,11.00,13,'其他',87.00,'河南省郑州市二七区南四环百荣商贸城A1区12排301号出租','','conveyance/abc93bed885c4c50aa414958db249104.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(17,22,'河南省','郑州市','二七区','河南省郑州市二七区连云路69号5号楼1单元18层东户','个人','',19.00,6.00,5.00,19.00,6,'小货车',136.00,'河南省郑州市二七区连云路69号5号楼1单元18层东户出租','','conveyance/e9dad2ce4b754871874c99fcc3eba3dd.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(18,57,'河南省','郑州市','金水区','河南省郑州市金水区经三路北99号附1号1号楼8层810号','个人','',13.00,14.00,2.00,8.00,6,'其他',102.00,'河南省郑州市金水区经三路北99号附1号1号楼8层810号出租','','conveyance/0fcb13475c4c45079e8482213965a30a.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(19,58,'河南省','郑州市','二七区','河南省郑州市二七区百荣世贸商城B1区17排313号','公司','郑州市二七区明宇商行',12.00,10.00,2.00,18.00,32,'普通货车',82.00,'河南省郑州市二七区百荣世贸商城B1区17排313号出租','','conveyance/574453.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(20,70,'河南省','郑州市','二七区','河南省郑州市二七区南四环百荣商贸城A1区12排301号','个人','',14.00,8.00,2.00,15.00,16,'其他',128.00,'河南省郑州市二七区南四环百荣商贸城A1区12排301号出租','','conveyance/669119.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(21,44,'河南省','郑州市','金水区','河南省郑州市金水区经三路北99号附1号1号楼8层810号','个人','',6.00,15.00,2.00,7.00,36,'普通货车',191.00,'河南省郑州市金水区经三路北99号附1号1号楼8层810号出租','','conveyance/724858.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(22,96,'浙江省','杭州市','萧山区','浙江省杭州市萧山区瓜沥镇坎山路258号','个人','',20.00,15.00,2.00,19.00,20,'小货车',26.00,'浙江省杭州市萧山区瓜沥镇坎山路258号出租','','conveyance/b46e5a0596bf48e08cb79097a8e3f6c8.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(23,71,'河南省','郑州市','二七区','河南省郑州市二七区连云路69号5号楼1单元18层东户','个人','',13.00,6.00,4.00,15.00,12,'其他',170.00,'河南省郑州市二七区连云路69号5号楼1单元18层东户出租','','conveyance/ebe96316a50b4f0683094e87a9e24401.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(24,38,'河南省','新乡市','红旗区','河南省新乡市红旗区化工路东段23号街坊','公司','河南金利尔奶业有限公司',9.00,20.00,4.00,13.00,33,'小货车',106.00,'河南省新乡市红旗区化工路东段23号街坊出租','','conveyance/1fed76518bb444c2a14eee443c035c0c.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(25,19,'广东省','广州市','海珠区','广东省广州市海珠区海珠区新港东路2433号403室','公司','广州振威国际展览有限公司',15.00,14.00,2.00,18.00,21,'小货车',75.00,'广东省广州市海珠区海珠区新港东路2433号403室出租','','conveyance/600787.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(26,22,'广东省','广州市','白云区','广东省广州市白云区太和镇头陂村飞鹅坑龙水井中五巷10','公司','广州帽峰山龙泉饮用水厂',7.00,9.00,2.00,9.00,26,'普通货车',190.00,'广东省广州市白云区太和镇头陂村飞鹅坑龙水井中五巷10出租','','conveyance/66912709aa9f44b8b2d764b25a699f3e.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(27,14,'广东省','广州市','白云区','广东省广州市白云区广州市白云区增槎路18号西华园401','公司','广州莎璐丝化妆品有限公司',6.00,10.00,5.00,5.00,35,'面包车',129.00,'广东省广州市白云区广州市白云区增槎路18号西华园401出租','','conveyance/75e6508cb71141d9b0e498a697c140e1.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL),(28,33,'重庆市','重庆市','九龙坡区','重庆市重庆市九龙坡区大公馆兴龙湾19号','个人','',4.00,19.00,3.00,17.00,38,'大货车',124.00,'重庆市重庆市九龙坡区大公馆兴龙湾19号出租','','conveyance/c22a2522a361467db515db5702c5b33f.jpg','1','1',NULL,'1','2019-04-07 00:51:26','2019-04-07 00:51:26',NULL);
/*!40000 ALTER TABLE `conveyance` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-04-07 17:21:18
