-- MySQL dump 10.13  Distrib 5.7.24, for osx10.13 (x86_64)
--
-- Host: localhost    Database: graduate
-- ------------------------------------------------------
-- Server version	5.7.24

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `warehouse`
--

DROP TABLE IF EXISTS `warehouse`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `warehouse` (
  `warehouseId` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `userId` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `province` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `city` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `country` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` varchar(225) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` double(8,2) NOT NULL,
  `category` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL,
  `company` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `environment` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '',
  `length` double(8,2) NOT NULL,
  `width` double(8,2) NOT NULL,
  `height` double(8,2) NOT NULL,
  `number` int(11) NOT NULL DEFAULT '1',
  `imagePath` text COLLATE utf8mb4_unicode_ci,
  `usedStatus` char(1) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `checkedStatus` char(1) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `checkedTime` datetime DEFAULT NULL,
  `status` char(1) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  `deleted_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`warehouseId`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `warehouse`
--

LOCK TABLES `warehouse` WRITE;
/*!40000 ALTER TABLE `warehouse` DISABLE KEYS */;
INSERT INTO `warehouse` VALUES (1,100,'黑龙江省伊春市南岔区伊春市南岔区东升街2号出租','北京市','市辖区','朝阳区','黑龙江省伊春市南岔区伊春市南岔区东升街2号',105.00,'公司','伊春森林和润生物','可存放家电、资料，食品、五金建材、家具等物资。库房有水电、消防。欢迎电话咨询，预约看厂房。','干燥;通风',3.00,8.00,16.00,1,'warehouse/2dfc3c40c81e45858d79d1d5f1e1a53d.jpg;warehouse/IrtiJ8dLsDvAwYyH42reqgHgzoFuoEnn9q59fZUl.jpeg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-07 00:42:03',NULL),(2,100,'河南省南阳市方城县城关镇豫01线南侧七峰大道西侧出租','河南省','南阳市','方城县','河南省南阳市方城县城关镇豫01线南侧七峰大道西侧',68.00,'个人',NULL,'可存放家电、资料，食品、五金建材、家具等物资。库房有水电、消防。欢迎电话咨询，预约看厂房。','通风',5.00,18.00,16.00,1,'warehouse/513429b6a98b4e1183cb308e5795dd5c.jpeg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-07 00:21:32',NULL),(3,100,'安徽省合肥市蜀山区宿松路3666号省医药集团7楼出租','安徽省','合肥市','蜀山区','安徽省合肥市蜀山区宿松路3666号省医药集团7楼',10.00,'个人','','','通风',6.00,14.00,14.00,1,'warehouse/740c3c88c62243a5b4e77aa98e55a251.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(4,100,'云南省昆明市官渡区金马寺金宅小区物业楼301室出租','云南省','昆明市','官渡区','云南省昆明市官渡区金马寺金宅小区物业楼301室',115.00,'个人','','','干燥',15.00,4.00,15.00,1,'warehouse/af49103cea064794a0cf416ac66d11a5.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(5,100,'河南省郑州市二七区郑密路99号1号楼1单元2504号出租','河南省','郑州市','二七区','河南省郑州市二七区郑密路99号1号楼1单元2504号',121.00,'个人','','','通风',17.00,3.00,10.00,1,'warehouse/c4c3e5f010ad4f8b877c6d1352f73f86.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(6,100,'湖北省武汉市黄陂区横店街临空街经济示范工业园12栋出租','湖北省','武汉市','黄陂区','湖北省武汉市黄陂区横店街临空街经济示范工业园12栋',52.00,'个人','','','干燥;通风',11.00,16.00,8.00,1,'warehouse/f7a78c8c6aec43bc9031f21c7fc0697c.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(7,100,'天津市天津市南开区南开区南马路与西马路交口东北侧如意大厦1号楼1门712出租','天津市','天津市','南开区','天津市天津市南开区南开区南马路与西马路交口东北侧如意大厦1号楼1门712',107.00,'个人','','','干燥;通风',16.00,7.00,5.00,1,'warehouse/1a6bf9fed6ee43039abd9a395a2bc37e.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(8,100,'山东省淄博市张店区西二路54号出租','山东省','淄博市','张店区','山东省淄博市张店区西二路54号',27.00,'个人','','','干燥;通风',17.00,20.00,9.00,1,'warehouse/33b62beef10a471a82120022263a1bc2.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(9,100,'广东省广州市番禺区广州市番禺区大龙街新桥村新环中路17号出租','广东省','广州市','番禺区','广东省广州市番禺区广州市番禺区大龙街新桥村新环中路17号',95.00,'公司','广州圆鑫机械制造有限公司','','干燥;通风',15.00,19.00,3.00,1,'warehouse/6000ffbec5b143299a98d5f8afa94e5c.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(10,100,'辽宁省大连市中山区大连市中山区人民路24号平安大厦1602室出租','辽宁省','大连市','中山区','辽宁省大连市中山区大连市中山区人民路24号平安大厦1602室',50.00,'个人','','','干燥;通风',14.00,14.00,8.00,1,'warehouse/95642d405b6b48ccaf9757b511b9c101.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(11,100,'河南省新乡市长垣县人民路147号出租','河南省','新乡市','长垣县','河南省新乡市长垣县人民路147号',101.00,'公司','河南东海亚泰生物工程有限公司','','干燥;通风',18.00,15.00,9.00,1,'warehouse/b35173e2657247c38437f50afe728262.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(12,100,'河北省石家庄市新华区石家庄市中华北大街350号旭日蓝天公寓9层出租','河北省','石家庄市','新华区','河北省石家庄市新华区石家庄市中华北大街350号旭日蓝天公寓9层',24.00,'公司','石家庄论彩企业营销策划有限公司','','干燥;通风',10.00,11.00,16.00,1,'warehouse/cda984694c274dd5aad8129137936187.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(13,100,'河南省南阳市卧龙区医圣祠街235号出租','河南省','南阳市','卧龙区','河南省南阳市卧龙区医圣祠街235号',11.00,'个人','','','通风',13.00,20.00,8.00,1,'warehouse/2072755841be43e49eea1a4dadf86f31.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(14,100,'四川省成都市龙泉驿区龙泉驿阳光村11组出租','四川省','成都市','龙泉驿区','四川省成都市龙泉驿区龙泉驿阳光村11组',28.00,'公司','成都一品庄园葡萄酒业有限公司','','干燥;通风',17.00,10.00,12.00,1,'warehouse/3688786b82894768aa11cc65e1034506.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(15,100,'江苏省淮安市淮阴区经济技术开发区空港产业园金港路办事处1楼103室出租','江苏省','淮安市','淮阴区','江苏省淮安市淮阴区经济技术开发区空港产业园金港路办事处1楼103室',148.00,'个人','','','干燥',15.00,3.00,3.00,1,'warehouse/608ba27c9b1145d69f69d79d50f42755.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(16,100,'山东省德州市德城区学院东路288号出租','山东省','德州市','德城区','山东省德州市德城区学院东路288号',84.00,'个人','','','干燥;通风',4.00,11.00,8.00,1,'warehouse/9c85e477fd6e48768776bac5aa1e4153.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(17,100,'上海市上海市普陀区金通路999号西北物流保税区出租','上海市','上海市','普陀区','上海市上海市普陀区金通路999号西北物流保税区',54.00,'公司','上海钰阳进出口有限公司','','通风',3.00,6.00,12.00,1,'warehouse/bf59aa1f682245a799a469cff6d7f51b.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(18,100,'上海市上海市浦东新区新金桥路58号13D（中国·上海自由贸易试验区）总部出租','上海市','上海市','浦东新区','上海市上海市浦东新区新金桥路58号13D（中国·上海自由贸易试验区）总部',47.00,'个人','','','干燥;通风',4.00,5.00,5.00,1,'warehouse/dd6ae8fcdc6e4b23b299ee838a5d6e2a.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(19,100,'上海市上海市浦东新区航川路50号14幢301出租','上海市','上海市','浦东新区','上海市上海市浦东新区航川路50号14幢301',72.00,'个人','','','通风',3.00,5.00,4.00,1,'warehouse/29f2f89acbd749dcb31519038a9ec14a.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(20,100,'四川省成都市金牛区金府路593号出租','四川省','成都市','金牛区','四川省成都市金牛区金府路593号',137.00,'个人','','','通风',16.00,17.00,5.00,1,'warehouse/3e8309306cdb43ffb473547d9735155e.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(21,100,'上海市上海市浦东新区浦东新区创业路369弄1-68号20幢3层302室出租','上海市','上海市','浦东新区','上海市上海市浦东新区浦东新区创业路369弄1-68号20幢3层302室',23.00,'个人','','','通风',15.00,5.00,16.00,1,'warehouse/63da238d422840ea90f07035fa060986.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(22,100,'福建省厦门市海沧区新阳街道新园南路19号出租','福建省','厦门市','海沧区','福建省厦门市海沧区新阳街道新园南路19号',101.00,'公司','厦门鸣远生物科技公司','','干燥',16.00,11.00,19.00,1,'warehouse/ab653075438d4bd2a48d0eea5f64cf85.jpeg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(23,100,'湖南省株洲市株洲县高新区橡果园长江南路8号出租','湖南省','株洲市','株洲县','湖南省株洲市株洲县高新区橡果园长江南路8号',112.00,'个人','','','通风',5.00,3.00,6.00,1,'warehouse/c19b7c9d9c604f3d8900f84bf4ba6697.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(24,100,'广东省广州市白云区人和镇大巷工业区同贵路自编8号出租','广东省','广州市','白云区','广东省广州市白云区人和镇大巷工业区同贵路自编8号',25.00,'个人','','','干燥',13.00,4.00,3.00,1,'warehouse/e7b28d5c703645ac999f0c008f676cd0.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(25,100,'广西柳州市柳南区飞鹅二路1号谷埠街国际商城K2栋1407号出租','广西省','柳州市','柳南区','广西柳州市柳南区飞鹅二路1号谷埠街国际商城K2栋1407号',15.00,'公司','柳州市佛利商贸有限公司','','干燥;通风',11.00,15.00,3.00,1,'warehouse/2cf35af4458d40c6ae9de6522fccf346.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(26,100,'山东省枣庄市市中区高新区张范街道上辛庄239号出租','山东省','枣庄市','市中区','山东省枣庄市市中区高新区张范街道上辛庄239号',123.00,'个人','','','干燥',18.00,12.00,14.00,1,'warehouse/3f00edaec1994d6eb87a8389117b96ce.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(27,100,'甘肃省张掖市甘州区甘肃省张掖市甘州区张大公路38公里处出租','甘肃省','张掖市','甘州区','甘肃省张掖市甘州区甘肃省张掖市甘州区张大公路38公里处',11.00,'公司','张掖市圣泉矿泉水有限公司','','通风',7.00,17.00,5.00,1,'warehouse/63ef929990984e96a56ab56c3d61dc19.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(28,100,'河北省保定市定州市长安区宏业大道23号出租','河北省','保定市','定州市','河北省保定市定州市长安区宏业大道23号',96.00,'个人','','','通风',9.00,8.00,17.00,1,'warehouse/ac1719b3765043ec95a020ab4de6f698.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(29,100,'上海市上海市浦东新区泰谷路169号2楼出租','上海市','上海市','浦东新区','上海市上海市浦东新区泰谷路169号2楼',66.00,'个人','','','通风',5.00,6.00,18.00,1,'warehouse/c3122590ef334d55bc777ca62cb7ab67.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(30,100,'广东省广州市海珠区广州市海珠区昌岗中路238号达镖国际中心1215室出租','广东省','广州市','海珠区','广东省广州市海珠区广州市海珠区昌岗中路238号达镖国际中心1215室',130.00,'个人','','','干燥',6.00,11.00,20.00,1,'warehouse/f02d0dd8f8b2423bad9eead89c3b5a10.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(31,100,'广东省云浮市云城区玉皇路57号物资公司大楼一层东起第一卡出租','广东省','云浮市','云城区','广东省云浮市云城区玉皇路57号物资公司大楼一层东起第一卡',78.00,'公司','云城区茶物语饮品店','','干燥;通风',20.00,6.00,3.00,1,'warehouse/84c17a09e0654be7988585aa67f41833.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(32,100,'河南省新乡市封丘县世纪大道188号出租','河南省','新乡市','封丘县','河南省新乡市封丘县世纪大道188号',84.00,'公司','生命果有机食品股份有限公司','','干燥;通风',3.00,8.00,5.00,1,'warehouse/532e36e66da6491f85ddeaf7113f6457.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(33,100,'上海市上海市浦东新区万芳路501号C栋307室出租','上海市','上海市','浦东新区','上海市上海市浦东新区万芳路501号C栋307室',41.00,'公司','绿堂（上海）生物科技有限公司','','通风',11.00,16.00,11.00,1,'warehouse/e4181390ea774d3f92b20e22b0464846.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL),(34,100,'陕西省渭南市富平县城关镇关圣路8号出租','陕西省','渭南市','富平县','陕西省渭南市富平县城关镇关圣路8号',96.00,'公司','陕西富四方柿业有限公司','','通风',14.00,20.00,3.00,1,'warehouse/f2ead139e29b4822bbbd96464eec3141.jpg','1','1',NULL,'1','2019-04-06 23:11:00','2019-04-06 23:11:00',NULL);
/*!40000 ALTER TABLE `warehouse` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-04-07 17:21:31
